app/controllers/sales_controller.rb

	def index
		@sales = Promotion.all
---
SELECT "promotions".* FROM "promotions"

	def post_submit
		promo = Promotion.new
		promo.description = params[:description]
		promo.title = params[:title]
		promo.link = params[:link]
		if !promo.link.start_with?('http') then
			promo.link = 'http://' + promo.link
		end

		promo.store_name = params[:storeName]
		promo.expiration = Date.parse(params[:date])
		password = params[:password]
		promo.save()
---
INSERT INTO "promotions" ("description", "title", "link", "store_name", "expiration", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

	def admin
		@sales = Promotion.all
---
SELECT "promotions".* FROM "promotions"

	def approve_promotion
		id = params[:id]
		code = params[:pw]
		passwordHash = "6de1c8799f4a4dbe4fa3cb35d0656490582bb0bed50304d2251532b8d94b322b" #lol why are you trying to find my passwords?
		if (Digest::SHA256.hexdigest(code) == passwordHash) then
			Promotion.find(id).update(approved: true)
---
SELECT  "promotions".* FROM "promotions" WHERE "promotions"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "promotions" SET "approved" = ?, "updated_at" = ? WHERE "promotions"."id" = ?  [["approved", "t"], ["updated_at", "2015-09-06 22:57:05.593823"], ["id", 8]]

	def delete_promotion
		id = params[:id]
		code = params[:pw]
		passwordHash = "6de1c8799f4a4dbe4fa3cb35d0656490582bb0bed50304d2251532b8d94b322b"
		if (Digest::SHA256.hexdigest(code) == passwordHash) then
			Promotion.find(id).destroy()
---
DELETE FROM "promotions" WHERE "promotions"."id" = ?  [["id", 1]]
SELECT  "promotions".* FROM "promotions" WHERE "promotions"."id" = ? LIMIT 1  [["id", 1]]